_site/app/controllers/memos_controller.rb

  def create
    @memo = current_user.memos.build(memo_params)

      if @memo.save
---
INSERT INTO "memos" ("created_at", "info", "link", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def destroy
    @memo.destroy
---
DELETE FROM "memos" WHERE "memos"."id" = ?  [["id", 11]]

    def set_memo
      @memo = Memo.find(params[:id])
---
SELECT "memos".* FROM "memos" WHERE "memos"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]