app/views/users/show.html.erb

<div class="span8">
    <% if @user.memos.any? %>
---
SELECT "memos".* FROM "memos" WHERE "memos"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
SELECT 1 AS one FROM "memos" WHERE "memos"."user_id" = ? ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]