_site/app/views/static_pages/home.html.erb

    <!-- <h2>links</h2> -->
    <% if current_user.memos.count == 0 %>
---
SELECT COUNT(*) FROM "memos" WHERE "memos"."user_id" = ?  [["user_id", 2]]